<!-- 首页=>顶部位置+搜索栏 -->

<template>
  <div class="wrapper" :style="showBgColor? 'background-color:white' : ''">
    <!-- 位置 -->
    <div class="location">
        <svg t="1585835305675" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2371" width="200" height="200"><path d="M416.00006 0.00064C186.368204-0.06336 0.12832 183.104526 0.00032 409.216384c0 226.047859 326.015796 571.903643 326.015796 571.903643 49.727969 57.087964 131.071918 57.343964 180.223888-0.256 0 0 325.759796-345.599784 325.759796-571.647643a406.207746 406.207746 0 0 0-121.919924-289.471819A419.071738 419.071738 0 0 0 416.00006 0.00064z m0 585.407634A192.44788 192.44788 0 0 1 238.208171 468.480347a187.327883 187.327883 0 0 1 41.791974-206.463871 194.559878 194.559878 0 0 1 209.727869-40.959974A189.439882 189.439882 0 0 1 608.38394 396.160392C608.31994 500.736327 522.239994 585.408274 416.00006 585.408274z" p-id="2372"></path></svg>
        <span class="txt">请选择位置</span>
        <svg t="1585835715004" class="icon-two" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3106" width="200" height="200"><path d="M946.986 372.374L558.08 797.651a61.202 61.202 0 0 1-45.972 20.801 61.202 61.202 0 0 1-45.976-20.801L77.226 372.374c-18.985-20.052-24.852-49.279-15.04-75.093s33.493-43.84 61.014-46.292h777.494c27.627 2.347 51.412 20.265 61.226 46.187 9.92 25.92 4.054 55.038-14.934 75.198z" p-id="3107"></path></svg>
    </div>
    <!-- 搜索框 -->
    <div class="search">
        <div class="box"> 
            <svg t="1585838947190" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4169" width="200" height="200"><path d="M950.071755 908.285558 706.231191 664.444994c53.31323-63.253626 85.541235-144.807037 85.541235-234.007615 0-200.797235-162.77834-363.575576-363.575576-363.575576S64.621275 229.640144 64.621275 430.437379c0 200.797235 162.77834 363.575576 363.575576 363.575576 91.494831 0 174.795025-34.031071 238.705614-89.802282l243.621577 243.621577c11.79872 11.79872 30.15274 12.45466 41.077557 1.529843C962.525392 938.437276 961.870476 920.083256 950.071755 908.285558zM120.556215 430.437379c0-169.661098 138.033773-307.640636 307.640636-307.640636 169.661098 0 307.640636 137.979538 307.640636 307.640636 0 169.661098-137.979538 307.640636-307.640636 307.640636C258.589988 738.078015 120.556215 600.098477 120.556215 430.437379z" p-id="4170"></path></svg>
            <span>输入商品名称</span>
        </div>
    </div>
  </div>
</template>

<script>
  export default {
    data() {
      return {
        showBgColor: false
      }
    },
    mounted () {
      let that = this;
      that.$nextTick(() => {
        //监听滚动事件
        window.addEventListener('scroll', that.handleScroll)
      });
    },
    methods: {
      handleScroll () {
        let that = this;
        //垂直滚动的值兼容问题
        let scrollTopE = window.pageYOffset || document.documentElement.scrollTop || document.body.scrollTop;
        // 返回当前屏幕高度(空白空间) 
        let screenHeight = window.screen.availHeight
        if (scrollTopE > 168) {
          // 添加搜索栏颜色
          this.showBgColor = true;
        } else {
          this.showBgColor = false;
        }
      },
    },
    beforeDestroy () {
      // 移除监听事件
      window.removeEventListener('scroll', this.handleScroll);
    }
  }

</script>

<style lang="less" scoped>
@import './Header.less';
</style>
